FI/Potilaan perustiedot/Integraatiopalvelu_Potilaanperustiedot_Esimerkkisanoma_UpdateNextOfKinData_Request_2.0.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Tieto.HCW.EIS.PatientDataIntegration.ServiceContracts" xmlns:urn1="urn:Tieto.HCW.EIS.PatientDataIntegration.WCFService" xmlns:tiet="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:tiet1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PatientDataIntegration.DataContracts">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:UpdateNextOfKinDataRequest>
         <urn1:MessageHeader>
            <tiet:MessageID>123</tiet:MessageID>
            <tiet:TransactionID>44</tiet:TransactionID>
            <tiet:SenderID>Keksi</tiet:SenderID>
            <tiet:SenderApplication>Portal</tiet:SenderApplication>
            <tiet:ReceiverID>Carea</tiet:ReceiverID>
            <tiet:ReceiverApplication>PatientData</tiet:ReceiverApplication>
            <tiet:CharacterSet>abc</tiet:CharacterSet>
            <tiet:DataServiceURL>joku.jossakin.com</tiet:DataServiceURL>
            <tiet:UserLanguageCode>fi-FI</tiet:UserLanguageCode>
            <tiet:VersionNumber>1</tiet:VersionNumber>
         </urn1:MessageHeader>
         <urn1:Common>
            <tiet:ContractKey>aaabbbccc</tiet:ContractKey>
            <tiet:UserId>JimiHe</tiet:UserId>
            <tiet:CallingSystem>Keksi</tiet:CallingSystem>
            <tiet:CallingUserId>1234</tiet:CallingUserId>
         </urn1:Common>
         <urn1:PatientId>
            <tiet1:Identifier>120566-A020</tiet1:Identifier>
         </urn1:PatientId>
        <urn1:NextOfKinUpd>
            <tiet1:PatientId>
               <tiet1:Identifier>291260-A020</tiet1:Identifier>
            </tiet1:PatientId>
            <tiet1:FamilyName>Testaus</tiet1:FamilyName>
            <tiet1:GivenNames>Kaisa</tiet1:GivenNames>
            <tiet1:Role>TRUSTEE</tiet1:Role>
            <tiet1:Primary>true</tiet1:Primary>
            <tiet1:PatientAgent>true</tiet1:PatientAgent>
            <tiet1:Payer>true</tiet1:Payer>
            <tiet1:Language>
               <tiet1:CodeSetName></tiet1:CodeSetName>
               <tiet1:CodeSetId></tiet1:CodeSetId>
               <tiet1:CodeValue>fi</tiet1:CodeValue>
               <tiet1:CodeDescription></tiet1:CodeDescription>
            </tiet1:Language>
            <tiet1:Addresses>
               <tiet1:Address>
                  <tiet1:AddressType>PRIMARY</tiet1:AddressType>
                  <tiet1:StreetAddress>tontturaitti 1</tiet1:StreetAddress>
                  <tiet1:PostalCode>77570</tiet1:PostalCode>
                  <tiet1:City>Jäppilä</tiet1:City>
               </tiet1:Address>
            </tiet1:Addresses>
            <tiet1:Telephones>
               <tiet1:TeleAddress>
                  <tiet1:TeleAddressType>MOBILE</tiet1:TeleAddressType>
                  <tiet1:AddressValue>0408811334</tiet1:AddressValue>
               </tiet1:TeleAddress>
            </tiet1:Telephones>
            <tiet1:PermissionForPatientData>true</tiet1:PermissionForPatientData>
            <tiet1:Notes>Hyvä ystävä</tiet1:Notes>
            <tiet1:Action>UPD</tiet1:Action>
         </urn1:NextOfKinUpd>
      </urn:UpdateNextOfKinDataRequest>
   </soapenv:Body>
</soapenv:Envelope>